cf/Catalogs/ИнструкцииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИнструкцииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ИнструкцииНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Описание = "файл не выбран"
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	СтандартнаяОбработка = Ложь;
	
	новАдресФайла = "";
	ИмяФайла = "";
	Если ПоместитьФайл(новАдресФайла, "", ИмяФайла, Истина, УникальныйИдентификатор) Тогда
		АдресФайла = новАдресФайла;
		Модифицированность = Истина;
		
		ВыбФайл = Новый Файл(ИмяФайла);
		Объект.Описание = Строка(Окр(ВыбФайл.Размер() / 1024)) + " Кб Дата изменения: " + Формат(ВыбФайл.ПолучитьВремяИзменения(), "ДФ=dd.MM.yyyy");
		
		ИмяФайла = СтрЗаменить(ИмяФайла, "\", Символы.ПС);
		Объект.Наименование = СтрПолучитьСтроку(ИмяФайла, СтрЧислоСтрок(ИмяФайла));
		Объект.Расширение = СтрЗаменить(ВыбФайл.Расширение, ".", "");
	КонецЕсли;
КонецПроцедуры
